app/controllers/friends_controller.rb

INSERT INTO "friends" ("First_name", "Last_name", "Email", "Phone_no", "Description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "First_name" = ?, "Last_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["First_name", "Bob"], ["Last_name", "urval"], ["updated_at", "2023-06-16 14:20:06.387926"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)